In [1]:
%matplotlib inline

In [2]:
#Dependencies

import matplotlib.pyplot as plt
import pandas as pd
import statistics
import numpy as np
from matplotlib.ticker import MultipleLocator

In [8]:
city_df=pd.read_csv('Resources/city_data.csv')
ride_df=pd.read_csv('Resources/ride_data.csv')

In [11]:
city_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [14]:
ride_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [16]:
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [17]:
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [18]:
city_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [19]:
ride_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [21]:
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [22]:
ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [23]:
city_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [25]:
sum(city_df['type']=="Urban")

66

In [26]:
sum(city_df['type']=="Suburban")

36

In [27]:
sum(city_df['type']=="Rural")

18

In [32]:
df=pd.merge(ride_df,city_df,on=["city","city"])

In [33]:
df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2019-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2019-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2019-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2019-01-02 14:14:50,13.89,424254840012,5,Urban

In [30]:
ride_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [31]:
city_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban